app/Models/GedungModel.php

SELECT *
FROM `gedung`
WHERE `kode` = 'A'
ORDER BY `kode`, CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(nomor, '.', 2), '.', -1) AS UNSIGNED), CAST(SUBSTRING_INDEX(nomor, '.', -1) AS UNSIGNED)
---
    public function getKode($kode, $lantai = null){
    $builder = $this->where('kode', $kode);

    if ($lantai !== null) {
        $builder = $builder->where('lantai', $lantai);
    }

    return $builder
        ->orderBy("kode")
        ->orderBy("CAST(SUBSTRING_INDEX(SUBSTRING_INDEX(nomor, '.', 2), '.', -1) AS UNSIGNED)")
        ->orderBy("CAST(SUBSTRING_INDEX(nomor, '.', -1) AS UNSIGNED)")
        ->findAll();