app/Models/PeminjamanModel.php

SELECT *
FROM `peminjaman`
ORDER BY `tanggal` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
---
    public function getAll($cari = null)
    {
        $builder = $this->orderBy('tanggal', 'DESC');

        if ($cari) {
            $builder = $this->where('tanggal', $cari);
        }

        return $builder->paginate(5, 'jadwal');

SELECT *
FROM `peminjaman`
WHERE `id_peminjaman` = '28'
 LIMIT 1
---
    public function detail($id_peminjaman)
    {
        return $this->where('id_peminjaman', $id_peminjaman)->first();

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
WHERE `status` = 'pending'
---
    public function countByStatus($status)
    {
        return $this->where('status', $status)
                    ->countAllResults(true); // RESET builder

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
---
    public function countAllPeminjaman()
    {
        return $this->countAllResults(true); // TOTAL SEMUA